{ "_id" : { "$oid" : "565e13d92bf8702a4466865a" }, "isbn" : "0385472579", "price" : 4.46, "quantity" : 39, "description" : "Inspired by the earliest and core texts of Zen Buddhism, Zen Speaks distills the philosophy and wisdom of Zen in a series of illustrated Chinese character cartoon panels that are irreverently humorous and profoundly wise.", "authorIntro" : "Tsai Chih Chung (Chinese: 蔡志忠; pinyin: Cài Zhìzhōng; born 1948) is a famous cartoonist born in Huatan, Changhua County, Taiwan of Taiwanese origins.[1] He is best known for his graphical works on Chinese philosophy and history, most notably the philosophers Laozi, Liezi, and Zhuangzi, which he made accessible and popularised through the use of plain language and visual aid of cartoon graphics.[2] Many of his earlier four paneled works contain elements of political satire and those which are purely comical such as his well known work, The Drunken Swordsman (大醉俠).[1]\nThe books of Tsai Chih Chung have been very well received by the public in both Taiwan and mainland China. They have subsequently been translated into dozens of languages including English.[2] He currently resides in Taiwan and Vancouver.", "addDate" : { "$date" : 1449006041490 }, "author" : [ "Tsai Chih Chung", "Brian Bruya" ], "__v" : 3, "sold" : 31, "title" : "Zen Speaks: Shouts of Nothingness", "comments" : [ { "_id" : { "$oid" : "565f82c3de7482f47ed73f54" }, "grade" : 5, "content" : "At first one might expect that cartoon is too informal a medium to convey the depth of a religion such as Zen. This book is beautiful in it's simplicity, the perfect starter for the religion. I recommend it as a gift to someone you love who is stressed out. Hopefully, Zen Speaks will help them to shine through adversity, as it has me. 6 stars.", "title" : "Wonderful, absolutely wonderful.", "user" : { "$oid" : "565e8af6c5d9b88657d85a74" }, "time" : { "$date" : 1449099971424 } } ] }
{ "_id" : { "$oid" : "565e2d3dcdceebf948ad64b9" }, "isbn" : "1936117363", "price" : 12, "quantity" : 34, "authorIntro" : "John Miedema is the author of Slow Reading (Litwin Books, 2009). The book is a concise review of research and concepts about the benefits of reading more slowly. The book examines the earliest references in religion and philosophy, makes connections with the Slow movement, and brings attention to emerging ideas in technology and culture. Miedema has been interviewed for articles that have appeared in the Associated Press, the Christian Science Monitor, Europa, the Guardian, Newsweek, and the Washington Post. He has presented on slow reading at the Salt Lake City Public Library and the Library of Congress. The book has recently been translated into Portuguese. Slow Reading is available from Litwin Books and most online bookstores.\nMiedema has a Master of Library and Information Science and works as an Information Technology Architect. His current writing project examines how changes in the format of the book are changing how we read and think, and our identities. He lives in Ottawa, Canada. You can read his blog at http://johnmiedema.ca, and contact him through email at john.miedema@gmail.com.", "description" : "Slow Reading examines the research in voluntary slow reading, from the earliest references in religion and philosophy, to the practice of close reading in the humanities, and the recent swell of interest associated with the Slow Movement. It looks at the diverse angles from which slow reading has been approached in education, library sciences and media studies. Research in psychology and neurophysiology provides a tentative explanation for the ongoing role of slow reading. The theme of locality in the Slow Movement provides insight into the importance of physical location in our relationship with information. Most of all, Slow Reading represents a rediscovery of the pleasure of reading for its own sake.", "addDate" : { "$date" : 1449012541488 }, "sold" : 35, "author" : [ "John Miedema" ], "__v" : 7, "title" : "Slow reading", "comments" : [ { "_id" : { "$oid" : "56612deed2d47bbdb8370742" }, "grade" : 2, "content" : "This is a very thin volume with very little to say. It is very vague about its central concept, slow reading. It begins with \"Slow reading is about reading at a reflective pace.\" But in the course of these 65 pages the author also speaks of slow reading as if it is about losing oneself in the text and at other times as if it is not either of these, but about taking notes, arguing with the text and following ideas of one's own. A scattershot approach to evidence complements this conceptual laxity. Finally, the bulk of this very small book is devoted to topics only tangentially related to slow-reading: the shape of future libraries and the task of future librarians, and the digital medium versus the print book.", "title" : "Not worth even a quick read", "user" : { "$oid" : "56612daad2d47bbdb837073f" }, "time" : { "$date" : 1449209326202 } }, { "_id" : { "$oid" : "56612f1cd2d47bbdb837074d" }, "grade" : 5, "content" : "This short, compact volume represents a cri de coeur, of sorts, from a man who clearly loves a good read and is perturbed by a world moving too fast to sit down, chill out, and immerse itself in a good book. We live in the \"Information Age\"--but, of course, there's a big difference between information and hard-won knowledge. A book demands a level of intellectual and emotional participation from a reader that movies and video games don't and I sincerely pity those people who have forgotten the simple pleasure of opening a new book to the first page and diving headfirst into the narrative. John Miedema preaches the practice of slow reading with the passion and conviction of a true believer and I commend him for doing his part to make us understand and value the printed word, its tradition, its legacy and, yes, its bright, shining future.", "title" : "A Tome Every Book Lover Should Own", "user" : { "$oid" : "56612ef3d2d47bbdb8370749" }, "time" : { "$date" : 1449209628493 } }, { "_id" : { "$oid" : "56613041d2d47bbdb8370764" }, "grade" : 4, "content" : "The title of the book might suggest a boring slog, but I found Slow Reading to be a quick, easy, and fun read. In it, John Miedema weaves his own reading and experiences through a thoughtful look at past and current trends in publishing and technology, couching personal reflections in a wide range of theories (i.e., New Criticism, Reader Response) on the purposes of and psychology of reading. The overarching theme of the book is how people relate to text--how different methods of reading and the form of the text itself can affect the readers' connection to the text. He also discusses less familiar engagement with text, such as the actual digestion of a book as symbolic internalization of ideas.", "title" : "Nice overview, fun to read", "user" : { "$oid" : "565e8af6c5d9b88657d85a74" }, "time" : { "$date" : 1449209921807 } } ] }
{ "_id" : { "$oid" : "56610d16499dcd5eb26d220b" }, "title" : "Concrete Mathematics", "isbn" : "0201558025", "price" : 68.37, "quantity" : 54, "authorIntro" : "Donald E. Knuth is known throughout the world for his pioneering work on algorithms and programming techniques, for his invention of the Tex and Metafont systems for computer typesetting, and for his prolific and influential writing. Professor Emeritus of The Art of Computer Programming at Stanford University, he currently devotes full time to the completion of these fascicles and the seven volumes to which they belong.", "description" : "his book introduces the mathematics that supports advanced computer programming and the analysis of algorithms. The primary aim of its well-known authors is to provide a solid and relevant base of mathematical skills - the skills needed to solve complex problems, to evaluate horrendous sums, and to discover subtle patterns in data. It is an indispensable text and reference not only for computer scientists - the authors themselves rely heavily on it! - but for serious users of mathematics in virtually every discipline. Concrete Mathematics is a blending of CONtinuous and disCRETE mathematics. \"More concretely,\" the authors explain, \"it is the controlled manipulation of mathematical formulas, using a collection of techniques for solving problems.\" The subject matter is primarily an expansion of the Mathematical Preliminaries section in Knuth's classic Art of Computer Programming, but the style of presentation is more leisurely, and individual topics are covered more deeply. Several new topics have been added, and the most significant ideas have been traced to their historical roots. The book includes more than 500 exercises, divided into six categories.Complete answers are provided for all exercises, except research problems, making the book particularly valuable for self-study. Major topics include: *Sums *Recurrences *Integer functions *Elementary number theory *Binomial coefficients *Generating functions *Discrete probability *Asymptotic methods This second edition includes important new material about mechanical summation. In response to the widespread use of the first edition as a reference book, the bibliography and index have also been expanded, and additional nontrivial improvements can be found on almost every page. Readers will appreciate the informal style of Concrete Mathematics. Particularly enjoyable are the marginal graffiti contributed by students who have taken courses based on this material. The authors want to convey not only the importance of the techniques presented, but some of the fun in learning and using them. 0201558025B04062001", "comments" : [ { "_id" : { "$oid" : "56612d4cd2d47bbdb837073d" }, "grade" : 5, "content" : "have the First Edition and came here to look into the Second Edition. There are several negative reviews and basically those folks have fundamental misunderstandings. So I'll add my review.\n\nFirst, what kind of book is it? It is not an introductory-level math book with lots and lots of repetition. It is a book on hard math, done in a concise manner by brilliant teachers who assume students are very comfortable with calculus, probability, etc. You really cannot afford to skip around and dabble as if this were an introductory algebra course or something. (I'm not being elitist. I did not attend Stanford and don't consider myself a math genius and am not making this a \"we versus the unwashed masses\" issue, as I have really struggled with the material myself.)\n\nSecond, what is the book about? Several reviewers have theories on where the \"Concrete\" part of the title comes from, but the bottom line is that it's a book on the discrete math that you need to know for theoretical computer science. (For example, discrete calculus versus the continuous calculus we all learned in school.) Any Analysis of Algorithms course, for example, will confront you with recurrence equations and lots of discrete math.\n\nThird, how is the book organized? At first, it appears rather disjoint. The authors have a sort of, \"Hey, look at that flower,\" and \"hey, look under this rock\" kind of approach as you walk down a path but the path itself isn't really spelled out. None-the-less, the book does build step-by-step from examples of recurrence equations (Towers of Hanooi, Josephus) in Chapter 1, to Generating Functions in Chapter 7.\n\nPerhaps they could have made the path more explicit, but I can't see how they'd organize it much differently.", "title" : "Great book... some reviewers simply don't get it.", "user" : { "$oid" : "56612cccd2d47bbdb8370733" }, "time" : { "$date" : 1449209164867 } }, { "_id" : { "$oid" : "56612f36d2d47bbdb837074e" }, "grade" : 4, "content" : "The problem is, the book looks as if it might be an entry level text and it is tempting to think that with a little extra hard work any intelligent, reasonably well-grounded mathematics undergraduate student could prove that he is a genius by mastering the content. A fair number, of course, will do just that. But many more will unnecessarily bloody their noses and egos.", "title" : "Beware of great books", "user" : { "$oid" : "56612ef3d2d47bbdb8370749" }, "time" : { "$date" : 1449209654482 } } ], "addDate" : { "$date" : 1449200918708 }, "sold" : 6, "author" : [ "Ronald L. Graham", "Donald E. Knuth", "Oren Patashnik" ], "__v" : 2 }
{ "_id" : { "$oid" : "566128a0d2d47bbdb837072e" }, "isbn" : "0814407714", "title" : "Cracking the corporate code", "price" : 19.95, "quantity" : 184, "description" : "\"Cracking the Corporate Code delves deeply into the lives and careers of 32 such notable professionals. These are not the men and women usually cited: the high-profile government officials, the legendary civil rights pioneers, or the megastar athletes who have leveraged their on-field success into positions of leadership. The authors have chosen instead to profile individuals who have risen through the ranks of America's most noteworthy businesses, to the highest echelons of corporate power and influence.\" In exclusive interviews, these men and women recount their impressive and widely differing career trajectories, revealing what motivated and discouraged them, their sources of support and conflict, and the strategies they developed to excel in organizations like PepsiCo, GE, Merrill Lynch, Kraft, Prudential, Chrysler, and dozens more.", "authorIntro" : "Price M. Cobbs, M.D., is co-author of Black Rage and The Jesus Bag, considered classics in the literature of African-American experience. Dr. Cobbs is also an internationally recognized expert on executive leadership, management development, and corporate diversity. He lives in San Francisco.\n\nJudith L. Turnock is an attorney, coach, and talent development expert. A lifelong advocate of racial, gender, and economic equality, she is committed to closing the communication gap between blacks and whites, both in the workplace and in the community at large. She lives in New York City.", "comments" : [ { "_id" : { "$oid" : "56612e55d2d47bbdb8370744" }, "grade" : 5, "content" : "Over 250 Black men and women have risen to senior positions in major corporations. Along their climb, these leaders have learned, grown, achieved, and influenced as highly effective executives. They have overcome the challenges of being Black, complicating the normally difficult path of moving up the corporate hierarchy. That's the primary story of this book. At least, that's the premise of a book subtitled \"The Revealing Success Stories of 32 African-American Executives.\"\n\nAll that aside, I gained a lot from this book. I'm not Black. I'm not a high level executive of a major corporation. I'm a Certified Management Consultant. I help executives do a better job as leaders. To give developing executives the answers they need to succeed, I'd recommend careful reading of this book. Page after page delivers valuable lessons in a captivating way.", "title" : "Insightful Advice for Rising [Black] Executives", "user" : { "$oid" : "56612daad2d47bbdb837073f" }, "time" : { "$date" : 1449209429411 } } ], "addDate" : { "$date" : 1449207968646 }, "sold" : 16, "author" : [ "Price M. Cobbs", "Judith L. Turnock" ], "__v" : 1 }
{ "_id" : { "$oid" : "56612af6d2d47bbdb8370730" }, "title" : "An Apology for Raymond Sebond (Penguin Classics)", "isbn" : "0140444939", "price" : 14.16, "quantity" : 84, "description" : "An Apology for Raymond Sebond is widely regarded as the greatest of Montaigne's essays: a supremely eloquent expression of Christian scepticism. An empassioned defence of Sebond's fifteenth-century treatise on natural theology, it was inspired by the deep crisis of personal melancholy that followed the death of Montaigne's own father in 1568, and explores contemporary Christianity in prose that is witty and frequently damning. As he searches for the true meaning of faith, Montaigne is heavily critical of the arrogant tendency of mankind to create God in its own image, and offers his personal reflections on the true role of man, the need to eschew personal arrogance, and the vital importance of faith if we are to understand our place in the universe. Wise, perceptive and remarkably informed, this is one of the true masterpieces of the essay form.", "authorIntro" : "Michel Eyquem, Seigneur de Montaigne, was born in 1533, the son and heir of Pierre, Seigneur de Montaigne (two previous children dying soon after birth). He was brought up to speak Latin as his mother tongue and always retained a Latin turn of mind; though he knew Greek, he preferred to use translations. After studying law he eventually became counselor to the Parlement of Bordeaux. He married in 1565. In 1569 he published his French version of the Natural Theology of Raymond Sebond; his Apology is only partly a defense of Sebond and sets skeptical limits to human reasoning about God, man and nature. He retired in 1571 to his lands at Montaigne, devoting himself to reading and reflection and to composing his Essays (first version, 1580). He loathed the fanaticism and cruelties of the religious wars of the period, but sided with Catholic orthodoxy and legitimate monarchy. He was twice elected Mayor of Bordeaux (1581 and 1583), a post he held for four years. He died at Montaigne (1592) while preparing the final, and richest, edition of his Essays.", "comments" : [ { "_id" : { "$oid" : "56612d69d2d47bbdb837073e" }, "grade" : 4, "content" : "Very insightful for a point of view not many think about.", "title" : "Insightful", "user" : { "$oid" : "56612cccd2d47bbdb8370733" }, "time" : { "$date" : 1449209193696 } }, { "_id" : { "$oid" : "56612e0cd2d47bbdb8370743" }, "grade" : 3, "content" : "The Apology which Montaigne wrote for the work of Raymond Sebond arose from his understanding of a book, Theologia Naturalis, written in an obscure form of Spanish, which Montaigne's father (\"in the `last days' of his life\") requested that Montaigne translate into French for the benefit of those who were engaged in the struggles of the Reformation, \"a period of intellectual ferment and of religious and political disarray.\" (p. ix). Montaigne finished and dedicated his translation on the day of his father's death, 18 June 1568, when Montaigne was 35, married, and engaged in a legal position. The Apology does not identify which of its ideas were original with Sebond. There is no index, so I am unsure of how often the name Sebond appears in the text The Introduction on pages ix to xxxiii explains the circumstances and theology of the book philosophically, as understood at All Souls College, Oxford, on Easter 1986. The dedication and \"Montaigne's translation and adaptation of the Prologus of Raymond Sebond\" appear on pages xl to xliv. Those who have a complete edition of the ESSAYS OF MICHEL DE MONTAIGNE should be able to find the material in this book at II:12, though this book is clear in which portions appeared in 1580, 1582, 1588, or from the \"text of the manuscript edition being prepared by Montaigne when he died, interpreted in the light of the posthumous editions.\" (p. xxxv).", "title" : "An old guide to religion, nature, and classical philosophy.", "user" : { "$oid" : "56612daad2d47bbdb837073f" }, "time" : { "$date" : 1449209356986 } }, { "_id" : { "$oid" : "56612f9ad2d47bbdb8370757" }, "grade" : 5, "content" : "One of my all time favorite college reads", "title" : "Five Stars", "user" : { "$oid" : "56612ef3d2d47bbdb8370749" }, "time" : { "$date" : 1449209754362 } } ], "addDate" : { "$date" : 1449208566966 }, "sold" : 6, "author" : [ "Michel de Montaigne" ], "__v" : 3 }
{ "_id" : { "$oid" : "56612b80d2d47bbdb8370731" }, "title" : "Learn how to die the easy way", "isbn" : "0954207971", "price" : 29.95, "quantity" : 997, "description" : "The limitless boundaries of the internet, and the endless possibilities that exist in cyberspace for communication and information, are what drives Nick Waplington's survey of what this new media holds for the artist and society in general. Not bound by social, moral or ethical considerations, the internet and its implications were elaborated on for Waplington's presence at the Venice Biennale. \n\nNick Waplington's contribution to the Venice Biennale in 2001 expresses a yearning for the artistic and commercial freedom that the web might yet expose, and a celebration of the dislocated reason behind conventional thoughts and the media they use.\n\nSomewhere out there lies the new unchartered frontier of cyberspace. In that Babel there are images, dreams, inert and vital messages, anonymous ciphers and calculating incubi. Because it is faceless, as if somehow subterranean, human dialogue and the expression of ideas can multiply without responsibility, without the parameters of authorial disciplines or social conventions.\n\nCould this be anarchy, of the kind that artists linger on street corners for? Nick Waplington, alert to these possibilities, went last year with a series of works to the Venice Biennale, which had commissioned him to elaborate on this theme. The result was undeniably the work of an artist, one who embraces the limitless avenues of freedom of expression on the internet.\n\nFor Waplington the medium is certainly the message, but one far more profound than McLuhan's epithet, since this is a medium not bound by social, moral or ethical considerations. It's as if he had found himself a child again, locked in the toy shop overnight, where train sets would double as conveyor belts of ideas, and Action Man as a table leg.\n\n\"If, as I suspect,\" says Waplington, \"the internet has broken the stranglehold of governments and large media corporations on mass communication, then we could be in for a very exciting period of development on a number of different levels. Would a breakdown of current modes of social, moral and political cohesion be too much for a man to ask for?\"", "authorIntro" : "Michel Eyquem, Seigneur de Montaigne, was born in 1533, the son and heir of Pierre, Seigneur de Montaigne (two previous children dying soon after birth). He was brought up to speak Latin as his mother tongue and always retained a Latin turn of mind; though he knew Greek, he preferred to use translations. After studying law he eventually became counselor to the Parlement of Bordeaux. He married in 1565. In 1569 he published his French version of the Natural Theology of Raymond Sebond; his Apology is only partly a defense of Sebond and sets skeptical limits to human reasoning about God, man and nature. He retired in 1571 to his lands at Montaigne, devoting himself to reading and reflection and to composing his Essays (first version, 1580). He loathed the fanaticism and cruelties of the religious wars of the period, but sided with Catholic orthodoxy and legitimate monarchy. He was twice elected Mayor of Bordeaux (1581 and 1583), a post he held for four years. He died at Montaigne (1592) while preparing the final, and richest, edition of his Essays.", "comments" : [ { "_id" : { "$oid" : "56612cf2d2d47bbdb8370734" }, "grade" : 5, "content" : "This book is worth to read.", "title" : "This is a good book", "user" : { "$oid" : "56612cccd2d47bbdb8370733" }, "time" : { "$date" : 1449209074439 } } ], "addDate" : { "$date" : 1449208704852 }, "sold" : 3, "author" : [ "Nick Waplington" ], "__v" : 1 }
